#+title: Hylinx Mod
#+FILETAGS: :work:
*** DONE capture your thoughts on "Hylinx Mod" :think:@computer:
:PROPERTIES:
:EFFORT:   8min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:11]
CLOCK: [2025-06-22 Sun 15:05]--[2025-06-22 Sun 15:11] =>  0:06
:END:
<2025-06-22 Sun 15:30-15:36>
*** DONE search for notes related to "Hylinx Mod" and dump them into the "basket" :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:14]
CLOCK: [2025-06-22 Sun 15:11]--[2025-06-22 Sun 15:14] =>  0:03
:END:
<2025-06-22 Sun 15:36-15:40>
*** DONE consolidate the basket of "Hylinx Mod" into a component outline :think:@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:22]
CLOCK: [2025-06-22 Sun 15:14]--[2025-06-22 Sun 15:22] =>  0:08
:END:
<2025-06-22 Sun 15:40-15:44>

*** DONE break down the components of "Hylinx Mod" into smaller ones :think:@computer:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-22 Sun 15:29]
CLOCK: [2025-06-22 Sun 15:22]--[2025-06-22 Sun 15:29] =>  0:07
:END:
<2025-06-22 Sun 15:44-15:52>

*** DONE sketch out tasks of "Hylinx Mod" :flow:@computer:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-23 Mon 15:04]
CLOCK: [2025-06-23 Mon 14:59]--[2025-06-23 Mon 15:04] =>  0:05
CLOCK: [2025-06-22 Sun 15:35]--[2025-06-22 Sun 15:41] =>  0:06
CLOCK: [2025-06-22 Sun 15:29]--[2025-06-22 Sun 15:30] =>  0:01
:END:
<2025-06-23 Mon 15:10-15:22>

***** DONE look online for and take notes on what experts think on Intelligent Plants
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-23 Mon 15:21]
CLOCK: [2025-06-23 Mon 15:05]--[2025-06-23 Mon 15:21] =>  0:16
:END:
<2025-06-23 Mon 15:22-15:30>
***** DONE look online for and take notes on what the existing depictions of Intelligent Plants are
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-24 Tue 15:02]
CLOCK: [2025-06-24 Tue 15:00]--[2025-06-24 Tue 15:02] =>  0:02
CLOCK: [2025-06-23 Mon 15:21]--[2025-06-23 Mon 15:24] =>  0:03
:END:
<2025-06-24 Tue 15:00-15:10>
***** DONE look online for and take notes on what conditions would lead to Intelligent Plants
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-24 Tue 15:10]
CLOCK: [2025-06-24 Tue 15:02]--[2025-06-24 Tue 15:10] =>  0:08
:END:
<2025-06-24 Tue 15:10-15:20>
***** DONE look online for and take notes on existing examples of Plant Intelligence
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-24 Tue 15:12]
CLOCK: [2025-06-24 Tue 15:10]--[2025-06-24 Tue 15:12] =>  0:02
:END:
<2025-06-24 Tue 15:20-15:30>
***** DONE brainstorm 15 traits the Hylinx have that would be unique :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-03 Thu 14:39]
CLOCK: [2025-07-03 Thu 14:30]--[2025-07-03 Thu 14:39] =>  0:09
:END:
<2025-07-03 Thu 14:30-14:38>
***** DONE write a description scrappy first contact mission - don't think too much! :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-03 Thu 14:47]
CLOCK: [2025-07-03 Thu 14:39]--[2025-07-03 Thu 14:47] =>  0:08
:END:
<2025-07-03 Thu 14:46-14:54>
***** DONE write a definition for a scrappy first contact mission - don't think too much! :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-03 Thu 14:56]
CLOCK: [2025-07-03 Thu 14:47]--[2025-07-03 Thu 14:56] =>  0:09
:END:
<2025-07-03 Thu 14:59-15:07>
****** DONE draw a sprite for the Glass Cannon consisting of basic shapes :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-03 Thu 15:13]
CLOCK: [2025-07-03 Thu 15:04]--[2025-07-03 Thu 15:13] =>  0:09
:END:
<2025-07-03 Thu 15:07-15:15>
****** DONE write a definition for the Glass Cannon :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-03 Thu 15:22]
CLOCK: [2025-07-03 Thu 15:14]--[2025-07-03 Thu 15:22] =>  0:08
:END:
<2025-07-03 Thu 15:15-15:23>
***** DONE brainstorm missions to add to the first contact mission :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-30 Mon 15:08]
CLOCK: [2025-06-30 Mon 15:06]--[2025-06-30 Mon 15:08] =>  0:02
:END:
<2025-06-30 Mon 15:00-15:15>
***** DONE describe my goals for the First Contact Mission :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-30 Mon 15:09]
CLOCK: [2025-06-30 Mon 15:08]--[2025-06-30 Mon 15:09] =>  0:01
:END:
<2025-06-24 Tue 15:15-15:23>
**** DONE describe jobs to be done in Hylinx Space :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-07 Mon 14:32]
CLOCK: [2025-07-07 Mon 14:28]--[2025-07-07 Mon 14:32] =>  0:04
:END:
<2025-07-07 Mon 14:30-14:38>
**** DONE remix the existing job definitions into ones that work in Hylinx Space :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-07 Mon 14:38]
CLOCK: [2025-07-07 Mon 14:32]--[2025-07-07 Mon 14:38] =>  0:06
:END:
<2025-07-07 Mon 14:38-14:42>
**** DONE brainstorm what set of "pros and cons" Hylinx outfits - both generally and faction-specific - might have :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-07 Mon 14:43]
CLOCK: [2025-07-07 Mon 14:38]--[2025-07-07 Mon 14:43] =>  0:05
:END:
<2025-07-07 Mon 14:42-14:54>
**** DONE select 3 pros and cons of Hylinx Outfits :@computer:think:convg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-07 Mon 14:47]
CLOCK: [2025-07-07 Mon 14:43]--[2025-07-07 Mon 14:47] =>  0:04
:END:
<2025-07-07 Mon 14:59-15:07>
***** DONE brainstorm 5 transport ship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-09 Wed 14:48]
CLOCK: [2025-07-09 Wed 14:46]--[2025-07-09 Wed 14:48] =>  0:02
:END:
<2025-07-09 Wed 15:25-15:33>
***** DONE select 3 transport ships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-09 Wed 14:52]
CLOCK: [2025-07-09 Wed 14:51]--[2025-07-09 Wed 14:52] =>  0:01
:END:
<2025-07-10 Thu 15:08-15:09>
***** DONE write up definitions for 3 transport ships :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-13 Sun 14:42]
CLOCK: [2025-07-13 Sun 14:36]--[2025-07-13 Sun 14:42] =>  0:06
:END:
<2025-07-13 Sun 14:35-14:43>
***** DONE brainstorm 5 light freighter ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-25 Wed 14:55]
CLOCK: [2025-06-25 Wed 14:51]--[2025-06-25 Wed 14:55] =>  0:04
:END:
<2025-06-25 Wed 15:14-15:22>
***** DONE select 3 light freighters :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-25 Wed 14:56]
CLOCK: [2025-06-25 Wed 14:55]--[2025-06-25 Wed 14:56] =>  0:01
:END:
<2025-06-25 Wed 15:22-15:23>
***** DONE write up definitions for 3 light freighters :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-25 Wed 15:06]
CLOCK: [2025-06-25 Wed 14:56]--[2025-06-25 Wed 15:06] =>  0:10
:END:
<2025-06-25 Wed 15:23-15:31>
***** DONE brainstorm 5 light warship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-30 Mon 14:50]
CLOCK: [2025-06-30 Mon 14:43]--[2025-06-30 Mon 14:50] =>  0:07
:END:
<2025-06-30 Mon 14:30-14:37>
***** DONE select 3 light warships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-30 Mon 14:53]
CLOCK: [2025-06-30 Mon 14:50]--[2025-06-30 Mon 14:53] =>  0:03
:END:
<2025-06-30 Mon 14:37-14:38>
***** TODO write up definitions for 3 light warships :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
CLOCK: [2025-06-30 Mon 14:53]--[2025-06-30 Mon 14:58] =>  0:05
:END:
***** DONE brainstorm 5 medium warship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-09 Wed 14:50]
CLOCK: [2025-07-09 Wed 14:49]--[2025-07-09 Wed 14:50] =>  0:01
:END:
<2025-07-09 Wed 15:41-15:49>
***** DONE select 3 medium warships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-13 Sun 14:29]
CLOCK: [2025-07-13 Sun 14:28]--[2025-07-13 Sun 14:29] =>  0:01
:END:
<2025-07-13 Sun 14:30-14:31>
***** DONE select 3 heavy warships :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-13 Sun 14:31]
CLOCK: [2025-07-13 Sun 14:29]--[2025-07-13 Sun 14:31] =>  0:02
:END:
<2025-07-13 Sun 14:31-14:32>
***** DONE brainstorm 5 interceptor ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-09 Wed 14:43]
CLOCK: [2025-07-09 Wed 14:40]--[2025-07-09 Wed 14:43] =>  0:03
:END:
<2025-07-09 Wed 14:30-14:38>
***** DONE brainstorm 5 utility ship ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-09 Wed 14:39]
CLOCK: [2025-07-09 Wed 14:31]--[2025-07-09 Wed 14:39] =>  0:08
:END:
<2025-07-09 Wed 14:38-14:46>
***** DONE select 3 utility ship :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-13 Sun 14:34]
CLOCK: [2025-07-13 Sun 14:31]--[2025-07-13 Sun 14:34] =>  0:03
:END:
<2025-07-13 Sun 14:33-14:34>
***** DONE brainstorm 5 drone ideas for the Hylinx - in general and faction-specific :@computer:think:divg:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-09 Wed 14:46]
CLOCK: [2025-07-09 Wed 14:44]--[2025-07-09 Wed 14:46] =>  0:02
:END:
<2025-07-09 Wed 14:46-14:54>
***** DONE select 3 drones :@computer:think:divg:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-13 Sun 14:36]
CLOCK: [2025-07-13 Sun 14:34]--[2025-07-13 Sun 14:36] =>  0:02
:END:
<2025-07-13 Sun 14:34-14:35>
******* DONE define the Klava's territory :@computer:think:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-17 Thu 14:37]
CLOCK: [2025-07-17 Thu 14:35]--[2025-07-17 Thu 14:37] =>  0:02
:END:
<2025-07-17 Thu 14:50-14:55>
******* DONE brainstorm 10 values for the Klava :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-17 Thu 14:47]
CLOCK: [2025-07-17 Thu 14:37]--[2025-07-17 Thu 14:47] =>  0:10
:END:
<2025-07-17 Thu 15:00-15:10>
******* DONE brainstorm 10 anti-values for the Klava :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-17 Thu 14:51]
CLOCK: [2025-07-17 Thu 14:47]--[2025-07-17 Thu 14:51] =>  0:04
:END:
<2025-07-17 Thu 15:10-15:20>
****** DONE brainstorm origins for the Klava :@computer:think:divg:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-07-17 Thu 14:58]
CLOCK: [2025-07-17 Thu 14:51]--[2025-07-17 Thu 14:58] =>  0:07
:END:
<2025-07-17 Thu 15:25-15:40>
